---
kind: type
id: T:Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleOverrides
source: html/8bef65c6-70bc-1a10-a9a4-47c8ec2cd842.htm
---
# Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleOverrides

A set of DirectContext3DHandleSettings that are stored by a view.

## Syntax (C#)
```csharp
public class DirectContext3DHandleOverrides : IDisposable
```